#pragma once

#include <stdint.h>
#include <float.h> 
#include <math.h>  
#include <stdarg.h> // va_list

///////////////////////////////////////////////////////////////////////
// Usage
//

// Flags:
// BASE_DEBUG         Enables asserts. Enabled by default.

// NOTE: Things to consider
// - Currently the math functions are in the header forcing us to include math.h here. They need to be in the 
//   header if there are to be marked inline. I think I would prefer they be in the .cpp file. We probably need
//   a cpp file because we need to include os.h somewhere and it is maybe cleaner than having a #define 
//   BASE_IMPLEMENTATION situation.

///////////////////////////////////////////////////////////////////////
// Platform detection
//

#if defined(_WIN32)
#  define BASE_OS_WINDOWS 1
#elif defined(__linux__)
#  define BASE_OS_LINUX 1
#elif defined(__APPLE__) || defined(__MACH__)
#  define BASE_OS_MAC 1
#elif defined(__unix__)
#  define BASE_OS_UNIX 1               // Some non-linux non-apple unix variety
#else
#  error "Could not detect operating system"
#endif

#if !defined(BASE_OS_WINDOWS)
#  define BASE_OS_WINDOWS 0
#endif
#if !defined(BASE_OS_LINUX)
#  define BASE_OS_LINUX 0
#endif
#if !defined(BASE_OS_MAC)
#  define BASE_OS_MAC 0
#endif
#if !defined(BASE_OS_UNIX)
#  define BASE_OS_UNIX 0
#endif

// Check clang first because clang often will define __GNUC__ or _MSC_VER as well
#if defined(__clang__)
#  define BASE_COMPILER_CLANG 1
#elif defined(_MSC_VER)

#define _NUM_ARGS(dummy, X100, X99, X98, X97, X96, X95, X94, X93, X92, X91, X90, X89, X88, X87, X86, X85, X84, X83, X82, X81, X80, X79, X78, X77, X76, X75, X74, X73, X72, X71, X70, X69, X68, X67, X66, X65, X64, X63, X62, X61, X60, X59, X58, X57, X56, X55, X54, X53, X52, X51, X50, X49, X48, X47, X46, X45, X44, X43, X42, X41, X40, X39, X38, X37, X36, X35, X34, X33, X32, X31, X30, X29, X28, X27, X26, X25, X24, X23, X22, X21, X20, X19, X18, X17, X16, X15, X14, X13, X12, X11, X10, X9, X8, X7, X6, X5, X4, X3, X2, X1, N, ...) N

#define NUM_ARGS(...) _NUM_ARGS(dummy, ##__VA_ARGS__, 100, 99, 98, 97, 96, 95, 94, 93, 92, 91, 90, 89, 88, 87, 86, 85, 84, 83, 82, 81, 80, 79, 78, 77, 76, 75, 74, 73, 72, 71, 70, 69, 68, 67, 66, 65, 64, 63, 62, 61, 60, 59, 58, 57, 56, 55, 54, 53, 52, 51, 50, 49, 48, 47, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0)

static_assert(NUM_ARGS() == 0, "Empty argument must be zero");
static_assert(NUM_ARGS(A) == 1, "Must be 1");
static_assert(NUM_ARGS(A, B) == 2, "Must be 2");

// If BASE_DEBUG is not defined then we enable it, 
// If BASE_DEBUG is defined but with no value then we still get assertions, 
// if BASE_DEBUG is zero then we don't have assertions (unless they are specifically turned on), 
// if BASE_DEBUG is on then we have assertions (unless they are specifically turned off).
#if !defined(BASE_DEBUG)
#  define BASE_DEBUG 1
#endif

void BaseAssertPrint_(const char *Format, ...);

#if (defined(BASE_ENABLE_ASSERT) && (BASE_ENABLE_ASSERT == 0)) || (!defined(BASE_ENABLE_ASSERT) && BASE_DEBUG == 0)
#  define Assert(Cond) ((void)0)
#else
// In this instance we don't want to macro expand Cond, so that we can print our macros without substitution.
#  define Assert(Cond) \
do { \
if (!static_cast<bool>((Cond))) { \
BaseAssertPrint_("%s:%s():%i: Assertion: `%s' failed.\n", __FILE__, __func__, __LINE__, #Cond); \
BASE_DEBUG_TRAP(); \
} \
} while(0) 

#endif

///////////////////////////////////////////////////////////////////////
// Helpers
//

#define Minimum(a, b) ((a) < (b) ? (a) : (b))
#define Maximum(a, b) ((a) > (b) ? (a) : (b))
#define Clamp(Value, Low, High) (((Value) < (Low)) ? (Low) : ((Value) > (High)) ? (High) : (Value))
#define ClampTop(a, b)    Minimum((a), (b))
#define ClampBottom(a, b) Maximum((a), (b))

#define KB(n) ((n) * 1024LLU)
#define MB(n) KB((n) * 1024LLU)
#define GB(n) MB((n) * 1024LLU)
#define TB(n) GB((n) * 1024LLU)

template <typename T, size_t n>
constexpr size_t ArrayCount(T(&)[n])
{
    return n;
}

#define SLL_APPEND(Head, Tail, Node) ((Tail) = (Tail) ? ((Tail)->Next = Node) : ((Head) = Node))

#define DLL_PUSH_TAIL(Head, Tail, Node) ((Tail) = ((Tail) ? (Node)->Prev = (Tail), (Tail)->Next = (Node) : (Head) = (Node)))
#define DLL_POP_TAIL(Head, Tail) ((Tail) == (Head) ? (Tail) = 0, (Head) = 0 : (Tail) = (Tail)->Prev)

#define DECIMAL_DIGIT_COUNT_MAX(type) (241 * sizeof(type) / 100 + 1)


///////////////////////////////////////////////////////////////////////
// Types
//

typedef int8_t   s8;
typedef int16_t  s16;
typedef int32_t  s32;
typedef int64_t  s64;

typedef uint8_t  u8;
typedef uint16_t u16;
typedef uint32_t u32;
typedef uint64_t u64;

typedef int32_t  b32;
typedef int16_t  b16;
typedef int8_t   b8;

typedef float    f32;
typedef double   f64;

static_assert(sizeof(u8)  == 1, "");
static_assert(sizeof(u16) == 2, "");
static_assert(sizeof(u32) == 4, "");
static_assert(sizeof(u64) == 8, "");

static_assert(sizeof(f32) == 4, "");
static_assert(sizeof(f64) == 8, "");

static_assert(sizeof(u8) == sizeof(s8), "");
static_assert(sizeof(u16) == sizeof(s16), "");
static_assert(sizeof(u32) == sizeof(s32), "");
static_assert(sizeof(u64) == sizeof(s64), "");

///////////////////////////////////////////////////////////////////////
// Arena
//

// From sanitizer/asan_interface.h
#if __has_feature(address_sanitizer) || defined(__SANITIZE_ADDRESS__)
#  define ASAN_ENABLED 1
#else
#  define ASAN_ENABLED 0
#endif

#if ASAN_ENABLED
extern "C" {
    void __asan_poison_memory_region(void const volatile *addr, size_t size);
    void __asan_unpoison_memory_region(void const volatile *addr, size_t size);
}
#  define ASAN_POISON_MEMORY_REGION(addr, size) __asan_poison_memory_region((addr), (size))
#  define ASAN_UNPOISON_MEMORY_REGION(addr, size) __asan_unpoison_memory_region((addr), (size))
#else
#  define ASAN_POISON_MEMORY_REGION(addr, size) ((void)(addr), (void)(size))
